tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard_bootloader/src/hal_entry.c
/**
  ******************************************************************************
  * @file    Main Code File
  ******************************************************************************
*/
#include "hal_data.h"
#include "uCAL_SPI.h"
#include "fw_update.h"
#include "uart_debug.h"
#include "watchdog.h"


FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
void mcuboot_quick_setup() BSP_PLACE_IN_SECTION(".code_in_gap*");
FSP_CPP_FOOTER

/*******************************************************************************************************************//**
 * Quick setup for MCUboot.
 * To update the linker regions of an application to be used with this bootloader, add a the *.bld file created during the
 * build as a File property in e2 studio or RASC under Project > Properties, then C/C++ Build > Build Variables with variable
 * name BootloaderDataFile.
 * If QSPI is used, the QSPI flash must be initialized in Extended-SPI mode by calling R_QSPI_Open() before boot_go() is called.
 **********************************************************************************************************************/
void MCuboot_QuickSetup(void)
{
#ifdef MCUBOOT_USE_MBED_TLS

    /* Initialize mbedtls. */
    mbedtls_platform_context ctx = {0};
    assert(0 == mbedtls_platform_setup(&ctx));
#elif (defined(MCUBOOT_USE_TINYCRYPT) && defined(RM_MCUBOOT_PORT_USE_TINYCRYPT_ACCELERATION))

    /* Initialize TinyCrypt port. */
    assert(FSP_SUCCESS == RM_TINCYRYPT_PORT_Init());
#elif (defined(MCUBOOT_USE_USER_DEFINED_CRYPTO_STACK))

/* Initialize Custom Crypto (Protected Mode) driver. */
    assert(FSP_SUCCESS == R_SCE_Open(&sce_ctrl, &sce_cfg));
#endif
    //first kick to reset WDT timeout.
    Watchdog_Refresh();
    /* Start the firmware update process */
	FW_UpdateProccess();
    
    //kick to reset WDT timeout.
    Watchdog_Refresh();
    
    /* Verify the boot image and get its location. */
    struct boot_rsp rsp;
    
    //get valid or invalid bank information
    //this function must return zero if 
    //a valid image was found and a no-zero
    //value if not.
    int bootValidBank = boot_go(&rsp);
    
    //if a not valid firmware is in the flash bank.
    //erase it and reset the system.
    //this situation can happned if a power off
    //happned when making a copy from the external
    //memory to the microcontroller memory.
    //our function only verify if we have the valid version
    //in the firmware signature, but bootValidBank,from mcuboot, 
    //verify if the image is corrupted or not.
    if ((0 != bootValidBank) && (FW_FirmVersionDetected()))
    {
        //Clear the "new app" memory region
        //corrupted firmware.
        FW_EraseFirstImage();
    }
    
    //asset to reset the system if
    //a corrupted or a empty bank was found.
    assert(bootValidBank == 0);

    ///Enter in the application
    //only if a valid(not corrupted) firmware
    //was detected.
    RM_MCUBOOT_PORT_BootApp(&rsp);
}

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    //wait to stabilaze wdt clock.
    R_BSP_SoftwareDelay(STABILIZATION_CLOCK_TIME_TO_WDT_MS, BSP_DELAY_UNITS_MILLISECONDS);
    //Initialize WDT(timeout set to 2.2 seconds).
    WatchdogInit();
    /* Initialize the UART module. */
    uCAL_UART_Init();
    /* Initialize the SPI module. */
    uCAL_SPI_Init();
    /* Launch the MCUboot process */
    MCuboot_QuickSetup();
#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart (bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open(&g_ioport_ctrl, g_ioport.p_cfg);
    }
}

#if BSP_TZ_SECURE_BUILD

BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
#endif

/*******************************************************************************************************************//**
 * Define the HardFault error for Software Reset
 **********************************************************************************************************************/
void HardFault_Handler(void)
{
	NVIC_SystemReset();
	while(1);
}